<?php

include 'functions.php';

$cat = $_GET['cat'] ?? 32;
$bid = $_GET['bid'] ?? 32976;
$cid = $_GET['cid'] ?? 32976;
$base_url = 'http://truyensac.herokuapp.com/665txt/';

$single_curl = single_curl('https://dichngay.com/translate?u=www.665txt.com/read/' . $cat . '/' . $bid . '/' . $cid . '.html');

$single_curl = html_entity_decode($single_curl);

preg_match('@<h1>(.*?)</h1>@si', $single_curl, $tieude);

// mota
preg_match('@<div id="content">\s*(.*?)\s*</div>@si', $single_curl, $noidung);

if (isset($_GET['txt'])) {
	echo header("Content-Type: text/plain");
	echo "{$tieude[1]}\n";
	$nd = wp_strip_all_tags($noidung[1]);
	echo normalize($nd);
	echo "\n\n";
} else {
	echo '<meta charset="UTF-8"><meta name="viewport" content="width=device-width, initial-scale=1.0">';
	echo '<h1>' . $tieude[1] . '</h1>';
	echo '<div>' . normalize($noidung[1]) . '</div>';
}


function normalize($text = '')
{
	$arr = [
		'《' => '⟨',
		'》' => '⟩',
		'　' => ' ',
		'ˉ' => '¯',
		'‥' => '¨',
		'‧' => '·',
		'•' => '·',
		'‵' => '`',
		'｀' => '`',
		'。' => '.',
		'﹒' => '.',
		'．' => '.',
		'﹐' => ',',
		'，' => ',',
		'﹑' => ',',
		'、' => ',',
		'︰' => ':',
		'∶' => ':',
		'﹔' => ';',
		'；' => ';',
		'﹕' => ':',
		'：' => ':',
		'﹖' => '?',
		'？' => '?',
		'﹗' => '!',
		'！' => '!',
		'﹙' => '(',
		'（' => '(',
		'﹚' => ')',
		'）' => ')',
		'﹛' => '{',
		'｛' => '{',
		'﹜' => '}',
		'｝' => '}',
		'【' => '[',
		'﹝' => '[',
		'［' => '[',
		'】' => ']',
		'﹞' => ']',
		'］' => ']',
		'＾' => '^',
		'﹟' => '#',
		'＃' => '#',
		'﹠' => '&',
		'＆' => '&',
		'﹡' => '*',
		'＊' => '*',
		'﹢' => '+',
		'＋' => '+',
		'﹣' => '-',
		'－' => '-',
		'﹤' => '<',
		'＜' => '<',
		'﹥' => '>',
		'＞' => '>',
		'﹦' => '=',
		'＝' => '=',
		'﹩' => '$',
		'＄' => '$',
		'﹪' => '%',
		'％' => '%',
		'﹫' => '@',
		'＠' => '@',
		'≒' => '≈',
		'≦' => '≤',
		'≧' => '≥',
		'︱' => '|',
		'｜' => '|',
		'︳' => '|',
		'︿' => '∧',
		'﹀' => '∨',
		'／' => '/',
		'＼' => '\\',
		'╴' => '_',
		'＿' => '_',
		'「' => '“',
		'」' => '”',
		'『' => '‘',
		'』' => '’',
		'＂' => '"',
		'～' => '~',
		'｟' => '(',
		'｠' => ')',
		'ａ' => 'a',
		'ｂ' => 'b',
		'ｃ' => 'c',
		'ｄ' => 'd',
		'ｅ' => 'e',
		'ｆ' => 'f',
		'ｇ' => 'g',
		'ｈ' => 'h',
		'ｉ' => 'i',
		'ｊ' => 'j',
		'ｋ' => 'k',
		'ｌ' => 'l',
		'ｍ' => 'm',
		'ｎ' => 'n',
		'ｏ' => 'o',
		'ｐ' => 'p',
		'ｑ' => 'q',
		'ｒ' => 'r',
		'ｓ' => 's',
		'ｔ' => 't',
		'ｕ' => 'u',
		'ｖ' => 'v',
		'ｗ' => 'w',
		'ｘ' => 'x',
		'ｙ' => 'y',
		'ｚ' => 'z',
		'Ａ' => 'A',
		'Ｂ' => 'B',
		'Ｃ' => 'C',
		'Ｄ' => 'D',
		'Ｅ' => 'E',
		'Ｆ' => 'F',
		'Ｇ' => 'G',
		'Ｈ' => 'H',
		'Ｉ' => 'I',
		'Ｊ' => 'J',
		'Ｋ' => 'K',
		'Ｌ' => 'L',
		'Ｍ' => 'M',
		'Ｎ' => 'N',
		'Ｏ' => 'O',
		'Ｐ' => 'P',
		'Ｑ' => 'Q',
		'Ｒ' => 'R',
		'Ｓ' => 'S',
		'Ｔ' => 'T',
		'Ｕ' => 'U',
		'Ｖ' => 'V',
		'Ｗ' => 'W',
		'Ｘ' => 'X',
		'Ｙ' => 'Y',
		'Ｚ' => 'Z',
		'１' => '1',
		'２' => '2',
		'３' => '3',
		'４' => '4',
		'５' => '5',
		'６' => '6',
		'７' => '7',
		'８' => '8',
		'９' => '9',
		'０' => '0',
	];

	foreach ($arr as $key => $value) {
		$text = str_replace($key, $value, $text);
	}

	return $text;

}